Autodesk.Revit.DB.CompoundStructureLayerFunction
Describes the purpose of the layer within a compound structure, such as
a wall or floor.

Autodesk.Revit.DB.CompoundStructureLayerFunction.StructuralDeck
A special layer considered to be structural decking.

Autodesk.Revit.DB.CompoundStructureLayerFunction.MembraneLayer
A membrane layer.

Autodesk.Revit.DB.CompoundStructureLayerFunction.Finish2
A finish layer.

Autodesk.Revit.DB.CompoundStructureLayerFunction.Finish1
A finish layer.

Autodesk.Revit.DB.CompoundStructureLayerFunction.ThermalOrAir
A thermal or air insulating layer.

Autodesk.Revit.DB.CompoundStructureLayerFunction.Substrate
A substrate layer.

Autodesk.Revit.DB.CompoundStructureLayerFunction.Structure
A structural layer.